<?php

return [
    'admin' => [
        'categories' => [
            'create' => [
                'success' => 'Категория добавлена',
                'error' => 'Ошибка добавления'
            ],
            'update' => [
                'success' => 'Категория отредактирована',
                'error' => 'Ошибка редактирования'
            ],
            'remove' => [
                'success' => 'Категория удалена',
                'error' => 'Ошибка удаления'
            ]
        ],
        'news' => [
            'create' => [
                'success' => 'Новость добавлена',
                'error' => 'Ошибка добавления'
            ],
            'update' => [
                'success' => 'Новость отредактирована',
                'error' => 'Ошибка редактирования'
            ],
            'remove' => [
                'success' => 'Новость удалена',
                'error' => 'Ошибка удаления'
            ]
        ],
        'news_sources' => [
            'create' => [
                'success' => 'Источник добавлен',
                'error' => 'Ошибка добавления'
            ],
            'update' => [
                'success' => 'Источник отредактирован',
                'error' => 'Ошибка редактирования'
            ],
            'remove' => [
                'success' => 'Источник удален',
                'error' => 'Ошибка удаления'
            ],
            'fill_news' => [
                'success' => 'Наполнение новостей из источника прошло успешно',
                'error' => 'Ошибка наполнения новостями'
            ]
        ],
        'users' => [
            'create' => [
                'success' => 'Пользователь добавлен',
                'error' => 'Ошибка добавления'
            ],
            'update' => [
                'success' => 'Пользователь отредактирован',
                'error' => 'Ошибка редактирования'
            ],
            'remove' => [
                'success' => 'Пользователь удален',
                'error' => 'Ошибка удаления'
            ]
        ]

    ]
];
